app/views/view/link.html.erb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
---

<% @book = Book.find(1) %>