app/views/view/urlfor.html.erb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]
---

<% @book = Book.find(2) %>