app/views/record/has_and_belongs.html.erb

<ul>
  <% @book.authors.each do |author| %>
---
SELECT "authors".* FROM "authors" INNER JOIN "authors_books" ON "authors"."id" = "authors_books"."author_id" WHERE "authors_books"."book_id" = ?  [["book_id", 2]]