app/views/record/hasmany.html.erb

<ul>
  <% @book.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  ORDER BY "reviews"."updated_at" DESC  [["book_id", 1]]