app/controllers/books_controller.rb

SELECT  "books".* FROM "books"  ORDER BY "books"."id" DESC LIMIT 1
---
  def index
    @books = Book.all

INSERT INTO "books" ("isbn", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["isbn", "123456"], ["title", "hoge"], ["created_at", "2015-08-25 21:34:33.875335"], ["updated_at", "2015-08-25 21:34:33.875335"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "isbn" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["isbn", "978-4-7741-5878-4"], ["updated_at", "2015-08-27 14:31:32.050902"], ["id", 1]]
---
  def update
    sleep 3
		respond_to do |format|
      if @book.update(book_params)