app/controllers/ctrl_controller.rb

  def updb
    @author = Author.find(params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", nil]]

  def updb_process
    @author = Author.find(params[:id])
    if @author.update(params.require(:author).permit(:data))
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "authors" SET "ctype" = ?, "photo" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["ctype", "image/jpeg"], ["photo", "<93297 bytes of binary data>"], ["updated_at", "2015-08-31 10:25:03.705444"], ["id", 1]]

  def show_photo
    id = params[:id] ? params[:id] : 1
    @author = Author.find(id)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]

  def get_xml
    @books = Book.all
---
SELECT "books".* FROM "books"

  def get_json
    @books = Book.all
---
SELECT "books".* FROM "books"

  def download
    @books = Book.all
---
SELECT "books".* FROM "books"