app/controllers/hello_controller.rb

SELECT "books".* FROM "books"
---
	def list
		@books = Book.all