app/controllers/record_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" IN (2, 5, 10)
---
  def find
    @books = Book.find([2,5,10])

SELECT  "books".* FROM "books" WHERE "books"."publish" = ? LIMIT 1  [["publish", "技術評論社"]]
---
	def find_by
		@book = Book.find_by(publish: "技術評論社")

SELECT  "books".* FROM "books" WHERE "books"."publish" = ? AND "books"."price" = ? LIMIT 1  [["publish", "技術評論社"], ["price", 2019]]
SELECT AVG("books"."price") FROM "books" WHERE "books"."publish" = ?  [["publish", "技術評論社"]]
---
	def find_by2
		@book = Book.find_by(publish: '技術評論社', price: 2919)

SELECT DISTINCT "books"."publish" FROM "books"  ORDER BY "books"."publish" ASC
---
	def select2
		@pubs = Book.select(:publish).distinct.order(:publish)

SELECT  "books".* FROM "books"  ORDER BY "books"."published" DESC LIMIT 3 OFFSET 4
---
	def offset
		@books = Book.order(published: :desc).limit(3).offset(4)

SELECT  "books".* FROM "books"  ORDER BY "books"."published" DESC LIMIT 3 OFFSET 0
---
	def page
		page_size = 3
		page_num = params[:id] == nil ? 0 : params[:id].to_i - 1
		@books = Book.order(published: :desc).limit(page_size).offset(page_size * page_num)

SELECT publish, AVG(price) as avg_price FROM "books" GROUP BY "books"."publish"
---
	def groupby
		@books = Book.select('publish, AVG(price) as avg_price').group(:publish)

SELECT publish, AVG(price) as avg_price FROM "books" GROUP BY "books"."publish" HAVING AVG(price) >= 2500
---
	def havingby
		@books = Book.select('publish, AVG(price) as avg_price').group(:publish).having('AVG(price) >= ?', 2500)

SELECT "books".* FROM "books" WHERE "books"."publish" = ?  ORDER BY "books"."published" ASC  [["publish", "技術評論社"]]
---
	def where2
		@books = Book.all
		@books.where!(publish: '技術評論社')
		@books.order!(:published)

SELECT "books".* FROM "books"
SELECT  "books".* FROM "books"  ORDER BY published DESC LIMIT 5
SELECT  "books".* FROM "books"  ORDER BY "books"."price" ASC LIMIT 5
---
	def none
		case params[:id]
			when 'all'
				@books = Book.all
			when 'new'
				@books = Book.order('published DESC').limit(5)
			when 'cheap'
				@books = Book.order(:price).limit(5)

SELECT "books"."title", "books"."price" FROM "books" WHERE "books"."publish" = ?  [["publish", "技術評論社"]]
---
	def pluck
		render text: Book.where(publish: '技術評論社').pluck(:title, :price)

SELECT  1 AS one FROM "books" WHERE "books"."publish" = ? LIMIT 1  [["publish", "技術評論社"]]
---
	def exists
		flag = Book.where(publish: '技術評論社').exists?

SELECT "reviews".* FROM "reviews"  ORDER BY "reviews"."updated_at" DESC
---
	def def_scope
		render text: Review.all.inspect

SELECT COUNT(*) FROM "books" WHERE "books"."publish" = ?  [["publish", "技術評論社"]]
---
	def count
		cnt = Book.where(publish: '技術評論社').count

SELECT AVG("books"."price") AS average_price, publish AS publish FROM "books" GROUP BY "books"."publish"
---
	def groupby2
		@books = Book.group(:publish).average(:price)

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ?  ORDER BY "reviews"."updated_at" DESC LIMIT 1  [["id", 3]]
---
  def belongs
    @review = Review.find(3)

SELECT  "books".* FROM "books" WHERE "books"."isbn" = ? LIMIT 1  [["isbn", "978-4-7741-5878-5"]]
---
  def hasmany
    @book = Book.find_by(isbn: '978-4-7741-5878-5')

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "yyamada"]]
---
  def hasone
    @user = User.find_by(username: 'yyamada')

SELECT  "books".* FROM "books" WHERE "books"."isbn" = ? LIMIT 1  [["isbn", "978-4-7741-5611-8"]]
---
  def has_and_belongs
    @book = Book.find_by(isbn: '978-4-7741-5611-8')

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "isatou"]]
---
  def has_many_through
    @user = User.find_by(username: 'isatou')

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "memos" ("body", "memoable_id", "memoable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "あとで買う"], ["memoable_id", 1], ["memoable_type", "Book"], ["created_at", "2015-08-31 06:34:14.537018"], ["updated_at", "2015-08-31 06:34:14.537018"]]
---
  def memorize
    @book = Book.find(1)
    @memo = @book.memos.build({ body: 'あとで買う' })
    if @memo.save

SELECT books.*, reviews.body, authors.name FROM "books" INNER JOIN "reviews" ON "reviews"."book_id" = "books"."id" INNER JOIN "authors_books" ON "authors_books"."book_id" = "books"."id" INNER JOIN "authors" ON "authors"."id" = "authors_books"."author_id"  ORDER BY books.title, reviews.updated_at
---
  def assoc_join
    @books = Book.joins(:reviews, :authors).order('books.title, reviews.updated_at').select('books.*, reviews.body, authors.name')

SELECT books.*, reviews.body, users.username FROM "books" INNER JOIN "reviews" ON "reviews"."book_id" = "books"."id" INNER JOIN "users" ON "users"."id" = "reviews"."user_id"
---
  def assoc_join2
    @books = Book.joins(reviews: :user).select('books.*, reviews.body, users.username')

SELECT books.*, reviews.body FROM "books" left join reviews on reviews.book_id = books.id
---
  def assoc_join3
    @books = Book.joins('left join reviews on reviews.book_id = books.id').select('books.*, reviews.body')

SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (1, 2, 3)
SELECT "books".* FROM "books"
---
  def assoc_includes
    @books = Book.includes(:authors).all