app/controllers/view_controller.rb

	def col_select
		@book = Book.new(publish: '技術評論社')
		@books = Book.select(:publish).distinct
---
SELECT DISTINCT "books"."publish" FROM "books"

	def col_select2
		@book = Book.new(publish: '技術評論社')
		@books = Book.select(:publish).distinct
---
SELECT DISTINCT "books"."publish" FROM "books"

	def group_select
		@review = Review.new
		@authors = Author.all
---
SELECT "authors".* FROM "authors"

	def group_select2
		@review = Review.new
		@authors = Author.all
---
SELECT "authors".* FROM "authors"

	def dat_select
		@book = Book.find(1)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]

	def col_radio
		@book = Book.new(publish: '技術評論社')
		@books = Book.select(:publish).distinct
---
SELECT DISTINCT "books"."publish" FROM "books"

	def fields
		@user = User.find(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

	def conc
		@books = Book.all
---
SELECT "books".* FROM "books"

  def partial_basic
    @book = Book.find(2)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]

  def partial_param
    @book = Book.find(2)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 2]]

  def partial_col
    @books = Book.all
---
SELECT "books".* FROM "books"

  def partial_spacer
    @books = Book.all
---
SELECT "books".* FROM "books"